package by.lesson.practics.class7;

import java.util.*;

public class MainClass {

    /*  Задача 1
        1. Заполнить HashMap 10 объектами <Integer, String>. Найти строки у которых ключ>5  вывести строки через запятую.
        1.1 Перемножить все ключи, у которых соответствующая строка состоит из более чем 5 элементов.

        Задача 2
        1. Создать класс пользователь. Поля логин, пароль, имя, фамилия.
        2. Создать класс UserRepository. Внутри класса создать статическую переменную List<User> users.
        3. Выполнить инициаизацию коллекции в статическом блоке. Создать 5 пользователей и заполнить поля.
        4. Создать класс сервис. Реализовать в этом классе метод аутенфикации  пользователя
            (void authenticate (String login, String password). Этот метод должен проверять наличие
            пользователя в репозитории по логину. Если пользователя нет, то выбрасываем собственное исключение (UserNotFoundException)
        5. В этом же методе выполнить проверку пароля пользователя, если по логину мы его нашли.
            Если пароль не совпадает, то выбрасываем собственное исключение NotCorrectPasswordException.
        6. В классе main при вызове метода аутенфикации перехватите исключение UserNotFoundException и выведите в консоль (нет пользователя)
        7. Также перехватите оставшиеся исключения и в блоке catch выведите в консоль сообщение (Вы не прошли аутенфикацию)

        Задача 3
        1. Создать класс Фирма. Создать класс Налоговая.
        1.1 Поля у фирмы. Наименование, сфера деятельности, идентификационный номер. Долг перед налоговой
        1.2 В классе налоговой создать поле типа HashMap(String, Collection<Фирма>>.
        1.3 Создать десять фирм.
        1.4 Добавить информацию о фирмах в налоговую со следующими ключами: Нет долгов, Не уплачено рублей
            до 10000, не уплачено рублей более 10000.
        1.5 *Создать метод, который после оплаты налога какой-нибудь фирмой проверял задолжность и
            перед налоговой, и мог переместить эту фирму в другой статус (в соответствующий ключ).
        Задача 4
        1. Добавьте поле age в классе User
        2. Создайте коллекцию TreeSet по пользователям (используйте класс User из 2 задания)
        3. Коллекция TreeSet должна возвращать отсортированных пользователей по возрасту.
        4. Выведите всех пользователей, которые есть в коллекции.

     */

    public static void main(String[] args) {
        Map<Integer, String> map = new HashMap<>();

        for (int i = 0; i < 10; i++) {
            map.put(i, "Value" + i);
        }

        List<String> result = new ArrayList<>();

        for (Integer mapKey: map.keySet()){
            if (mapKey > 5) result.add(map.get(mapKey));
        }

        for (String elResult: result){
            System.out.print(elResult);
            //System.out.print(", ");       -- потом придумаю
        }

        //1.1
        int resInt = 0;
        for (Integer mapKey: map.keySet()){
            if (map.get(mapKey).length() > 5){
                if (resInt == 0) resInt = mapKey;
                else resInt *= mapKey;
            }
        }
        System.out.println("\n************");
        System.out.println("resInt = " + resInt);


        //2
        System.out.println("\n******* USERS ********");
        Service service = new Service();

        try {
            service.authenticate("login33", "password4");
        } catch (UserNotFoundException e){
            System.out.println("нет пользователя");
        } catch (Exception e){                                      //"Оставшиеся" исключения это вот эти? Если другие два кастомные из RuntimeException
            System.out.println("Вы не прошли аутентификацию");
        }
    }
}
