package by.lesson.practics.class4;

public class Task6 {
    /*Задача №2
        1. Создать класс Student.
        1.1 Определить поля в классе Student: возраст (тип int), идентификационный номер (тип long), успеваемость (тип short),
            имя (тип String), фамилия (тип String). Создать конструктор со всеми параметрами класса. Создать конструктор без параметров.
        1.2 В классе Main создать 3-ёх студентов. При этом значение полей у двух студентов должны быть одинаковыми.
        1.3 Выполнить сравнение студентов вызвав метод equals и вывести результаты в консоль.
        1.4 Вызвать метод toString(). Результат вызова метода вывести в консоль.
        1.5 Вызвать метод hashCode().
        1.6 Переопределить без генерации методы equals(), hashcode(), toString()
        1.7 Повторить пункты 1.3, 1.4. Сравнить результаты.

     */
}
