package by.lesson.practics.class4;

public class Task5 {
    /*  1. Класс Деревня. Деревня будет состоять из построек. К постройкам относятся промышленные здания и гражданские. К промышленным зданиям
            будут относится заводы и фермы. К гражданским будут относится: административные здания, жилые здания.
        1.1 Создать класс Постройка (Building). Поля у класса Постройка: улица, материал стен, год постройки.
        1.2 Создать класс Гражданские здания (CivilBuilding). Гражданские здания должны наследоваться от класса Постройка.
            Поля у класса Гражданские здания: назначение (жилье или общественные здания), количество этажей.
        1.3 Создать класс Промышленном здание (IndustrialBuilding). Промышленные здания наследуются от Постройки.
            Поля которые можно определить в Промышленном здании: отрасль (Отрасль в которой здание задействовано
            (машиностроительная, легкая промышленность, целлюлозная промышленность, сельское хозяйство)
        1.4 Создать класс Административном здание. Административное здание должно наследоваться от Гражданского здания.
            Поля, которые можно определить в Административном здании: назначение административного здания (офисное, кинотеатр,
            спортсооружение),число людей, на которое рассчитано здание.
        1.5 Создать класс Многоквартирный жилой дом. Вопрос: От какого класса должен наследоваться Многоквартирный жилой дом.
            Поля, которые можно определить в Многоквартирном жилье: количество квартир.
        1.6 Создать класс фабрика. Вопрос: От какого класса должна наследоваться Фабрика. Поля, которые можно определить
            в Фабрике: количество работников, выпускаемая продукция (запчасти, полиэтилен и т.д.)
            Все поля должны быть с модификатором доступа private. Реализовывать методы getter и setter по необходимости.
            Инициализацию объекта производить через конструктор.
        2.1 Создать спортсооружение, исполком, 2 жилых дома, 2 фабрики Значения придумать самим.
            Добавить эти объекты в деревню (реализовать метод по добавлению постройки в деревню)
            (должны придумать, как это сделать)
        2.2 Получить значение количества людей, которые могут находиться в спортсооружении,
            созданном выше, и вывести это в консоль (метод getter)
        2.3 Изменить количество людей, которые могут находиться в спортсооружении и вывести их
            в консоль после изменения (методы setter и getter)
        2.4 Реализовать метод по выводу информации о каждой постройке.
        2.5 Реализовать метод по подсчету общего количества зданий в деревне.
        2.6 Посчитать количество промышленных зданий в деревне. И вывести информацию об этих зданиях.
     */

    public static void main(String[] args) {
        Village village = new Village(5);

        AdminBuilding sportBuild = new AdminBuilding("Sport-Street", "Wood", 1990,
                                                "Admin", 30, "Sport", 20);
        AdminBuilding ispolkom = new AdminBuilding("Ispolkom-Street", "Wood", 1985,
                                             "Admin", 15, "Ispolkom", 10);
        ApartmentBuilding[] apartBuilds = new ApartmentBuilding[2];
        Factory[] factories = new Factory[2];

        for (int i = 0; i < apartBuilds.length; i++) {
            apartBuilds[i] = new ApartmentBuilding("Street" + i, "Wood", 1995,
                    "Apart", 300, 10);
        }

        for (int i = 0; i < factories.length; i++) {
            factories[i] = new Factory("Street" + i, "Wood", 1995,
                                    "Building", 500, "Build");
        }


        System.out.println("2.2: " + sportBuild.getCountOfPeople());
        sportBuild.setCountOfPeople(50);
        System.out.println("2.3: " + sportBuild.getCountOfPeople());

        village.addBuild(sportBuild);
        village.addBuild(ispolkom);
        village.addBuild(apartBuilds[0]);
        village.addBuild(apartBuilds[1]);
        village.addBuild(factories[0]);

        village.addBuild(factories[1]);

        System.out.println("2.5: ");
        village.getCountOfBuilds();
        System.out.println("2.6: ");
        village.getInfOfIndustBuilds();
    }
}
